#+TITLE: TODO
#+SEQ_TODO: NEXT(n) TODO(t) WAITING(w) SOMEDAY(s) PROJ(p) | DONE(d) CANCELED(c)
#+COLUMNS: %7TODO(To Do) %32ITEM(Task) %TAGS(Tags) %6CLOCKSUM(Time) %8Effort(Effort)
#+PROPERTY: Effort_ALL 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00
#+PROPERTY: Rating_ALL + ++ +++ ++++ +++++

#+BEGIN: clocktable :scope file :maxlevel 6 :block untilnow
#+CAPTION: Clock summary at [2019-05-08 Wed 01:06], for now.
| Headline                                     | Time       |           |          |
|----------------------------------------------+------------+-----------+----------|
| *Total time*                                 | *22d 7:30* |           |          |
|----------------------------------------------+------------+-----------+----------|
| FlyingBergman                                | 22d 7:30   |           |          |
| \_  Electronics                              |            | 10d 22:00 |          |
| \_    High level diagram                     |            |           |     3:00 |
| \_    Design voltage sensing                 |            |           |     6:30 |
| \_    Analog inputs                          |            |           |     5:00 |
| \_    Button inputs                          |            |           |     1:00 |
| \_    EtherCAT                               |            |           |     4:00 |
| \_    CAN                                    |            |           |     2:30 |
| \_    Digital IO                             |            |           |     1:00 |
| \_    Power supplies                         |            |           |     5:00 |
| \_    Schematic review                       |            |           | 1d 17:30 |
| \_    Board layout                           |            |           |  3d 2:30 |
| \_    Order boards                           |            |           |     9:00 |
| \_    Assembly                               |            |           |  1d 5:30 |
| \_    Board bringup and bugfixes for self... |            |           |  1d 4:30 |
| \_  Research                                 |            |   1d 1:30 |          |
| \_  Marketing                                |            |  2d 18:30 |          |
| \_  Admin                                    |            |     19:30 |          |
| \_  Software                                 |            |  6d 14:30 |          |
| \_    Prepare theboss for standalone builds  |            |           |     5:30 |
| \_    Console driver improvements            |            |           |     1:00 |
| \_    MCP2317 device support                 |            |           |     1:30 |
| \_    Timer support and dts nodes            |            |           |     5:00 |
| \_    I2C support                            |            |           |     4:30 |
| \_    Gate driver debugging and drivers      |            |           |     1:30 |
| \_    Analog device support                  |            |           |  1d 1:30 |
| \_    Cylinder and joystick                  |            |           |    12:00 |
| \_    Leds and buttons support               |            |           |     2:00 |
| \_    Meetings and discussions               |            |           |     7:30 |
| \_    CAN bus support                        |            |           | 1d 21:00 |
| \_    Code review and refactor               |            |           |    23:00 |
| \_    Controller implementation              |            |           |    11:30 |
| \_    UI console                             |            |           |     4:30 |
| \_    USB                                    |            |           |     8:30 |
| \_  Fix the time interval bug                |            |      1:30 |          |
| \_  Port to the new boss                     |            |      0:30 |          |
| \_  User manual                              |            |      1:30 |          |
#+END:

* FlyingBergman
** DONE Electronics
:LOGBOOK:
CLOCK: [2019-01-05 Sat 20:00]--[2019-01-05 Sat 21:30] =>  1:30
CLOCK: [2019-01-06 Sun 15:30]--[2019-01-06 Sun 16:00] =>  0:30
CLOCK: [2019-01-07 Mon 10:00]--[2019-01-07 Mon 12:00] =>  2:00
CLOCK: [2019-01-07 Mon 16:30]--[2019-01-07 Mon 18:00] =>  1:30
CLOCK: [2019-01-07 Mon 20:30]--[2019-01-07 Mon 22:30] =>  2:00
CLOCK: [2019-01-21 Mon 19:00]--[2019-01-21 Mon 21:00] =>  2:00
CLOCK: [2019-01-22 Tue 16:00]--[2019-01-22 Tue 16:30] =>  0:30
CLOCK: [2019-01-22 Tue 19:30]--[2019-01-22 Tue 21:30] =>  2:00
CLOCK: [2019-01-23 Wed 10:00]--[2019-01-23 Wed 12:30] =>  2:30
CLOCK: [2019-01-25 Fri 09:00]--[2019-01-25 Fri 13:00] =>  4:00
CLOCK: [2019-01-25 Fri 13:30]--[2019-01-25 Fri 16:00] =>  2:30
CLOCK: [2019-01-26 Sat 07:30]--[2019-01-26 Sat 08:00] =>  0:30
CLOCK: [2019-01-27 Sun 07:00]--[2019-01-27 Sun 08:30] =>  1:30
CLOCK: [2019-01-28 Mon 19:30]--[2019-01-28 Mon 21:00] =>  1:30
CLOCK: [2019-01-29 Tue 20:00]--[2019-01-29 Tue 21:30] =>  1:30
CLOCK: [2019-01-30 Wed 15:00]--[2019-01-30 Wed 16:00] =>  1:00
CLOCK: [2019-01-30 Wed 20:30]--[2019-01-30 Wed 21:30] =>  1:00
CLOCK: [2019-01-31 Thu 05:30]--[2019-01-31 Thu 07:00] =>  1:30
CLOCK: [2019-01-31 Thu 09:00]--[2019-01-31 Thu 13:30] =>  4:30
- Note taken on [2019-01-31 Thu 09:00] \\
Opamps
CLOCK: [2019-01-31 Thu 19:00]--[2019-01-31 Thu 21:00] =>  2:00
- Note taken on [2019-01-31 Thu 19:00] \\
Bemf sensing circuit
CLOCK: [2019-02-01 Fri 05:00]--[2019-02-01 Fri 07:30] =>  2:30
- Note taken on [2019-02-01 Fri 05:00] \\
Gpio control signals
CLOCK: [2019-02-01 Fri 12:00]--[2019-02-01 Fri 15:30] =>  3:30
CLOCK: [2019-02-02 Sat 02:00]--[2019-02-02 Sat 06:00] =>  4:00
CLOCK: [2019-04-17 Wed 06:00]--[2019-04-17 Wed 07:00] =>  1:00
- Note taken on [2019-04-17 Wed 06:00] \\
Contacts order
CLOCK: [2019-04-26 Fri 11:00]--[2019-04-26 Fri 15:00] =>  4:00
- Note taken on [2019-04-26 Fri 11:00] \\
FB boards prep
:END:
*** DONE High level diagram
:LOGBOOK:
CLOCK: [2019-01-22 Tue 10:00]--[2019-01-22 Tue 13:00] =>  3:00
- Note taken on [2019-01-22 Tue 10:00] \\
High level diagram
:END:
*** DONE Design voltage sensing
:LOGBOOK:
CLOCK: [2019-01-23 Wed 13:30]--[2019-01-23 Wed 16:00] =>  2:30
- Note taken on [2019-01-23 Wed 13:30] \\
Design of voltage sensing
CLOCK: [2019-01-24 Thu 05:30]--[2019-01-24 Thu 06:30] =>  1:00
- Note taken on [2019-01-24 Thu 05:30] \\
Voltage sensing design
CLOCK: [2019-01-24 Thu 20:00]--[2019-01-24 Thu 21:00] =>  1:00
- Note taken on [2019-01-24 Thu 20:00] \\
Voltage sensing
CLOCK: [2019-01-25 Fri 05:00]--[2019-01-25 Fri 07:00] =>  2:00
- Note taken on [2019-01-25 Fri 05:00] \\
Voltage sensing
:END:
*** DONE Analog inputs
:LOGBOOK:
CLOCK: [2019-01-27 Sun 19:30]--[2019-01-27 Sun 21:00] =>  1:30
- Note taken on [2019-01-27 Sun 19:30] \\
Thinking about analog inputs
CLOCK: [2019-01-28 Mon 04:30]--[2019-01-28 Mon 06:30] =>  2:00
- Note taken on [2019-01-28 Mon 04:30] \\
Analog in 5v
CLOCK: [2019-01-28 Mon 17:00]--[2019-01-28 Mon 18:30] =>  1:30
- Note taken on [2019-01-28 Mon 17:00] \\
Analog in
:END:
*** DONE Button inputs
:LOGBOOK:
CLOCK: [2019-01-28 Mon 07:30]--[2019-01-28 Mon 08:30] =>  1:00
- Note taken on [2019-01-28 Mon 07:30] \\
Simulating button inputs
:END:
*** DONE EtherCAT
:LOGBOOK:
CLOCK: [2019-01-28 Mon 14:30]--[2019-01-28 Mon 15:00] =>  0:30
- Note taken on [2019-01-28 Mon 14:30] \\
Footprint for Lan9252
CLOCK: [2019-01-29 Tue 11:00]--[2019-01-29 Tue 14:30] =>  3:30
- Note taken on [2019-01-29 Tue 11:00] \\
Digital io and ethercat
:END:
*** DONE CAN
:LOGBOOK:
CLOCK: [2019-01-29 Tue 04:30]--[2019-01-29 Tue 07:00] =>  2:30
- Note taken on [2019-01-29 Tue 04:30] \\
Add can interfaces
:END:
*** DONE Digital IO
:LOGBOOK:
CLOCK: [2019-01-30 Wed 06:00]--[2019-01-30 Wed 07:00] =>  1:00
- Note taken on [2019-01-30 Wed 06:00] \\
Look at io expanders
:END:
*** DONE Power supplies
:LOGBOOK:
CLOCK: [2019-01-30 Wed 08:30]--[2019-01-30 Wed 11:00] =>  2:30
- Note taken on [2019-01-30 Wed 08:30] \\
Power supply
CLOCK: [2019-01-30 Wed 12:00]--[2019-01-30 Wed 14:30] =>  2:30
- Note taken on [2019-01-30 Wed 12:00] \\
Power supplies
:END:
*** DONE Schematic review
:LOGBOOK:
CLOCK: [2019-02-05 Tue 10:30]--[2019-02-05 Tue 11:30] =>  1:00
- Note taken on [2019-02-05 Tue 10:30] \\
Start schematic review
CLOCK: [2019-02-10 Sun 14:00]--[2019-02-10 Sun 15:30] =>  1:30
CLOCK: [2019-02-11 Mon 05:00]--[2019-02-11 Mon 07:00] =>  2:00
- Note taken on [2019-02-11 Mon 05:00] \\
Review
CLOCK: [2019-02-11 Mon 10:00]--[2019-02-11 Mon 13:00] =>  3:00
CLOCK: [2019-02-11 Mon 14:00]--[2019-02-11 Mon 16:30] =>  2:30
CLOCK: [2019-02-14 Thu 05:30]--[2019-02-14 Thu 07:00] =>  1:30
CLOCK: [2019-02-14 Thu 15:00]--[2019-02-14 Thu 16:00] =>  1:00
CLOCK: [2019-02-15 Fri 05:30]--[2019-02-15 Fri 06:30] =>  1:00
CLOCK: [2019-02-15 Fri 07:00]--[2019-02-15 Fri 08:00] =>  1:00
CLOCK: [2019-02-15 Fri 10:30]--[2019-02-15 Fri 12:00] =>  1:30
CLOCK: [2019-02-15 Fri 13:30]--[2019-02-15 Fri 16:00] =>  2:30
CLOCK: [2019-02-15 Fri 20:00]--[2019-02-15 Fri 21:00] =>  1:00
CLOCK: [2019-02-16 Sat 05:00]--[2019-02-16 Sat 07:30] =>  2:30
- Note taken on [2019-02-16 Sat 05:00] \\
Review
CLOCK: [2019-02-16 Sat 20:00]--[2019-02-16 Sat 21:00] =>  1:00
- Note taken on [2019-02-16 Sat 20:00] \\
Opamps
CLOCK: [2019-02-17 Sun 05:00]--[2019-02-17 Sun 09:00] =>  4:00
CLOCK: [2019-02-17 Sun 20:30]--[2019-02-17 Sun 21:30] =>  1:00
CLOCK: [2019-02-18 Mon 05:00]--[2019-02-18 Mon 08:00] =>  3:00
CLOCK: [2019-02-18 Mon 09:00]--[2019-02-18 Mon 10:30] =>  1:30
CLOCK: [2019-02-18 Mon 11:00]--[2019-02-18 Mon 12:30] =>  1:30
CLOCK: [2019-02-19 Tue 06:00]--[2019-02-19 Tue 07:30] =>  1:30
CLOCK: [2019-02-19 Tue 09:00]--[2019-02-19 Tue 11:00] =>  2:00
CLOCK: [2019-02-19 Tue 13:00]--[2019-02-19 Tue 17:00] =>  4:00
:END:
*** DONE Board layout
:LOGBOOK:
CLOCK: [2019-02-20 Wed 05:30]--[2019-02-20 Wed 07:00] =>  1:30
- Note taken on [2019-02-20 Wed 05:30] \\
Rough connector placement
CLOCK: [2019-02-20 Wed 10:30]--[2019-02-20 Wed 12:00] =>  1:30
- Note taken on [2019-02-20 Wed 10:30] \\
Joystick inputs placement
CLOCK: [2019-02-20 Wed 14:00]--[2019-02-20 Wed 17:00] =>  3:00
- Note taken on [2019-02-20 Wed 14:00] \\
Optimize connectors
CLOCK: [2019-02-21 Thu 05:00]--[2019-02-21 Thu 07:00] =>  2:00
- Note taken on [2019-02-21 Thu 05:00] \\
Better layout
CLOCK: [2019-02-21 Thu 09:30]--[2019-02-21 Thu 11:30] =>  2:00
- Note taken on [2019-02-21 Thu 09:30] \\
Power layout
CLOCK: [2019-02-21 Thu 14:00]--[2019-02-21 Thu 14:30] =>  0:30
CLOCK: [2019-02-21 Thu 15:00]--[2019-02-21 Thu 18:30] =>  3:30
- Note taken on [2019-02-21 Thu 15:00] \\
Bunch of layout work
CLOCK: [2019-02-22 Fri 05:00]--[2019-02-22 Fri 07:30] =>  2:30
CLOCK: [2019-02-22 Fri 10:00]--[2019-02-22 Fri 13:30] =>  3:30
CLOCK: [2019-02-22 Fri 14:00]--[2019-02-22 Fri 16:30] =>  2:30
- Note taken on [2019-02-22 Fri 14:00] \\
Layout
CLOCK: [2019-02-23 Sat 20:30]--[2019-02-23 Sat 21:30] =>  1:00
CLOCK: [2019-02-25 Mon 05:00]--[2019-02-25 Mon 07:30] =>  2:30
CLOCK: [2019-02-25 Mon 09:30]--[2019-02-25 Mon 12:30] =>  3:00
- Note taken on [2019-02-25 Mon 09:30] \\
Fix issue with power stage
CLOCK: [2019-02-25 Mon 13:00]--[2019-02-25 Mon 14:00] =>  1:00
CLOCK: [2019-02-25 Mon 16:00]--[2019-02-25 Mon 17:00] =>  1:00
- Note taken on [2019-02-25 Mon 16:00] \\
Power
CLOCK: [2019-02-26 Tue 05:00]--[2019-02-26 Tue 07:00] =>  2:00
- Note taken on [2019-02-26 Tue 05:00] \\
Track widths and layout
CLOCK: [2019-02-26 Tue 09:30]--[2019-02-26 Tue 14:30] =>  5:00
CLOCK: [2019-02-27 Wed 09:30]--[2019-02-27 Wed 12:30] =>  3:00
- Note taken on [2019-02-27 Wed 09:30] \\
Routing
CLOCK: [2019-02-27 Wed 14:30]--[2019-02-27 Wed 16:30] =>  2:00
- Note taken on [2019-02-27 Wed 14:30] \\
Ethercat layout
CLOCK: [2019-02-28 Thu 05:00]--[2019-02-28 Thu 07:00] =>  2:00
- Note taken on [2019-02-28 Thu 05:00] \\
Cleanup around mcu
CLOCK: [2019-02-28 Thu 09:00]--[2019-02-28 Thu 14:00] =>  5:00
- Note taken on [2019-02-28 Thu 09:00] \\
Layout work
CLOCK: [2019-03-01 Fri 08:30]--[2019-03-01 Fri 12:30] =>  4:00
- Note taken on [2019-03-01 Fri 08:30] \\
Layout
CLOCK: [2019-03-01 Fri 13:30]--[2019-03-01 Fri 16:00] =>  2:30
- Note taken on [2019-03-01 Fri 13:30] \\
Last layout
CLOCK: [2019-03-01 Fri 20:00]--[2019-03-01 Fri 23:30] =>  3:30
- Note taken on [2019-03-01 Fri 20:00] \\
Power plane
CLOCK: [2019-03-02 Sat 05:30]--[2019-03-02 Sat 08:00] =>  2:30
- Note taken on [2019-03-02 Sat 05:30] \\
All routed. Just a review left.
CLOCK: [2019-03-03 Sun 06:30]--[2019-03-03 Sun 10:00] =>  3:30
CLOCK: [2019-03-03 Sun 16:00]--[2019-03-03 Sun 18:00] =>  2:00
- Note taken on [2019-03-03 Sun 16:00] \\
111 tracks reviewed
CLOCK: [2019-03-03 Sun 20:00]--[2019-03-03 Sun 21:30] =>  1:30
- Note taken on [2019-03-03 Sun 20:00] \\
200 tracks
CLOCK: [2019-03-03 Sun 22:00]--[2019-03-03 Sun 23:30] =>  1:30
- Note taken on [2019-03-03 Sun 22:00] \\
318 tracks reviewed
CLOCK: [2019-03-04 Mon 05:30]--[2019-03-04 Mon 07:00] =>  1:30
- Note taken on [2019-03-04 Mon 05:30] \\
375 tracks done
CLOCK: [2019-03-04 Mon 09:30]--[2019-03-04 Mon 10:30] =>  1:00
- Note taken on [2019-03-04 Mon 09:30] \\
Finish track review
CLOCK: [2019-03-04 Mon 11:00]--[2019-03-04 Mon 12:00] =>  1:00
- Note taken on [2019-03-04 Mon 11:00] \\
Finish board
:END:
*** DONE Order boards
:LOGBOOK:
CLOCK: [2019-03-04 Mon 12:00]--[2019-03-04 Mon 14:00] =>  2:00
- Note taken on [2019-03-04 Mon 12:00] \\
Get quote from pcbway
CLOCK: [2019-03-06 Wed 08:30]--[2019-03-06 Wed 13:00] =>  4:30
- Note taken on [2019-03-06 Wed 08:30] \\
Figuring out how to reduce bom costs
CLOCK: [2019-03-07 Thu 05:30]--[2019-03-07 Thu 06:30] =>  1:00
- Note taken on [2019-03-07 Thu 05:30] \\
Send new bom and mail gunnar
CLOCK: [2019-03-12 Tue 11:00]--[2019-03-12 Tue 12:30] =>  1:30
- Note taken on [2019-03-12 Tue 11:00] \\
Beställa komponenter
:END:
*** DONE Assembly
:LOGBOOK
CLOCK: [2019-03-14 Thu 19:00]--[2019-03-14 Thu 20:00] =>  1:00
- Note taken on [2019-03-14 Thu 19:00] \\
Pcb assembly prep
CLOCK: [2019-03-14 Thu 20:00]--[2019-03-14 Thu 22:00] =>  2:00
- Note taken on [2019-03-14 Thu 20:00] \\
Apply solder paste
CLOCK: [2019-03-14 Thu 21:30]--[2019-03-14 Thu 23:00] =>  1:30
- Note taken on [2019-03-14 Thu 22:30] \\
Picknplace
CLOCK: [2019-03-14 Thu 00:00]--[2019-03-14 Thu 02:30] =>  2:30
- Note taken on [2019-03-14 Thu 00:00] \\
Picknplace
CLOCK: [2019-03-15 Fri 07:00]--[2019-03-15 Fri 07:30] =>  0:30
- Note taken on [2019-03-15 Fri 07:00] \\
Picknplace
CLOCK: [2019-03-15 Fri 08:30]--[2019-03-15 Fri 12:30] =>  4:00
- Note taken on [2019-03-15 Fri 08:30] \\
Picknplace
CLOCK: [2019-03-15 Fri 14:00]--[2019-03-15 Fri 16:30] =>  2:30
- Note taken on [2019-03-15 Fri 14:00] \\
Heat soldering top side
CLOCK: [2019-03-15 Fri 16:30]--[2019-03-15 Fri 19:30] =>  3:00
- Note taken on [2019-03-15 Fri 16:30] \\
Soldering through holes
CLOCK: [2019-03-16 Sat 06:00]--[2019-03-16 Sat 07:30] =>  1:30
- Note taken on [2019-03-16 Sat 06:00] \\
Wicking
CLOCK: [2019-03-17 Sun 05:30]--[2019-03-17 Sun 07:30] =>  2:00
- Note taken on [2019-03-17 Sun 05:30] \\
Wicking excess solder paste
CLOCK: [2019-03-17 Sun 07:30]--[2019-03-17 Sun 09:00] =>  1:30
- Note taken on [2019-03-17 Sun 07:30] \\
Assemble connectors
CLOCK: [2019-03-17 Sun 12:30]--[2019-03-17 Sun 14:30] =>  2:00
- Note taken on [2019-03-17 Sun 12:30] \\
Soldering tht
CLOCK: [2019-03-17 Sun 21:00]--[2019-03-17 Sun 22:30] =>  1:30
- Note taken on [2019-03-17 Sun 21:00] \\
Bottom side assembly
CLOCK: [2019-03-18 Mon 09:30]--[2019-03-18 Mon 13:30] =>  4:00
- Note taken on [2019-03-18 Mon 09:30] \\
Last soldering of bottom side
:END:
*** DONE Board bringup and bugfixes for self soldered boards
:LOGBOOK:
CLOCK: [2019-03-18 Mon 15:30]--[2019-03-18 Mon 16:30] =>  1:00
- Note taken on [2019-03-18 Mon 15:30] \\
Verification
CLOCK: [2019-03-18 Mon 19:30]--[2019-03-18 Mon 23:30] =>  4:00
- Note taken on [2019-03-18 Mon 19:30] \\
Bringup
CLOCK: [2019-03-19 Tue 08:30]--[2019-03-19 Tue 13:30] =>  5:00
- Note taken on [2019-03-19 Tue 08:30] \\
Removing solder shorts
CLOCK: [2019-03-19 Tue 15:00]--[2019-03-19 Tue 16:30] =>  1:30
- Note taken on [2019-03-19 Tue 15:00] \\
Bringup power on 3rd board
CLOCK: [2019-03-19 Tue 19:30]--[2019-03-19 Tue 21:30] =>  2:00
- Note taken on [2019-03-19 Tue 19:30] \\
Looking for short on 5v
CLOCK: [2019-03-20 Wed 04:30]--[2019-03-20 Wed 07:00] =>  2:30
- Note taken on [2019-03-20 Wed 04:30] \\
Short on 5 and 3v3
CLOCK: [2019-03-20 Wed 09:00]--[2019-03-20 Wed 14:00] =>  5:00
- Note taken on [2019-03-20 Wed 09:00] \\
3 flashable boards. Sorted all shorts
CLOCK: [2019-03-27 Wed 06:00]--[2019-03-27 Wed 07:00] =>  1:00
- Note taken on [2019-03-27 Wed 06:00] \\
Dts for motor control
CLOCK: [2019-04-15 Mon 09:00]--[2019-04-15 Mon 13:00] =>  4:00
- Note taken on [2019-04-15 Mon 09:00] \\
Debugging factory boards
CLOCK: [2019-04-16 Tue 09:00]--[2019-04-16 Tue 11:30] =>  2:30
- Note taken on [2019-04-16 Tue 09:00] \\
Bringup of remaining boards
:END:
** DONE Research
:LOGBOOK:
CLOCK: [2019-01-15 Tue 16:00]--[2019-01-15 Tue 17:00] =>  1:00
- Note taken on [2019-01-15 Tue 16:00] \\
Som mldules
CLOCK: [2019-01-16 Wed 13:00]--[2019-01-16 Wed 14:00] =>  1:00
CLOCK: [2019-01-17 Thu 21:30]--[2019-01-17 Thu 22:30] =>  1:00
- Note taken on [2019-01-17 Thu 21:30] \\
Crane system
CLOCK: [2019-01-21 Mon 08:00]--[2019-01-21 Mon 12:00] =>  4:00
- Note taken on [2019-01-21 Mon 08:00] \\
Plan new board
CLOCK: [2019-01-21 Mon 13:00]--[2019-01-21 Mon 16:00] =>  3:00
CLOCK: [2019-01-22 Tue 04:30]--[2019-01-22 Tue 06:00] =>  1:30
- Note taken on [2019-01-22 Tue 04:30] \\
Find components
CLOCK: [2019-01-24 Thu 15:30]--[2019-01-24 Thu 17:00] =>  1:30
CLOCK: [2019-01-29 Tue 15:30]--[2019-01-29 Tue 16:00] =>  0:30
- Note taken on [2019-01-29 Tue 15:30] \\
Read about lan9252 spi mode.
CLOCK: [2019-02-10 Sun 17:00]--[2019-02-10 Sun 18:30] =>  1:30
- Note taken on [2019-02-10 Sun 17:00] \\
Getting canopen sonar working
CLOCK: [2019-02-10 Sun 20:30]--[2019-02-10 Sun 23:00] =>  2:30
- Note taken on [2019-02-10 Sun 20:30] \\
Sonar chip comm working
CLOCK: [2019-02-18 Mon 14:00]--[2019-02-18 Mon 15:00] =>  1:00
- Note taken on [2019-02-18 Mon 14:00] \\
Kicad cursor
CLOCK: [2019-02-20 Wed 09:00]--[2019-02-20 Wed 10:30] =>  1:30
- Note taken on [2019-02-20 Wed 09:00] \\
Figjre out strategy flr nofits
CLOCK: [2019-03-22 Fri 15:30]--[2019-03-22 Fri 16:30] =>  1:00
- Note taken on [2019-03-22 Fri 15:30] \\
Nvim integrations
CLOCK: [2019-03-23 Sat 04:30]--[2019-03-23 Sat 07:00] =>  2:30
- Note taken on [2019-03-23 Sat 04:30] \\
Publish libs to github and add submodules
CLOCK: [2019-04-29 Mon 11:00]--[2019-04-29 Mon 13:00] =>  2:00
- Note taken on [2019-04-29 Mon 11:00] \\
Why my scope no work
:END:
** DONE Marketing
:LOGBOOK:
CLOCK: [2019-01-06 Sun 10:00]--[2019-01-06 Sun 12:00] =>  2:00
- Note taken on [2019-01-06 Sun 10:00] \\
Företag research
CLOCK: [2019-01-10 Thu 15:00]--[2019-01-10 Thu 16:30] =>  1:30
CLOCK: [2019-01-13 Sun 19:30]--[2019-01-13 Sun 21:00] =>  1:30
- Note taken on [2019-01-13 Sun 19:30] \\
Video
CLOCK: [2019-01-15 Tue 13:30]--[2019-01-15 Tue 14:00] =>  0:30
CLOCK: [2019-01-18 Fri 13:00]--[2019-01-18 Fri 15:30] =>  2:30
- Note taken on [2019-01-18 Fri 13:00] \\
Offert Gunnar
CLOCK: [2019-01-22 Tue 15:00]--[2019-01-22 Tue 16:00] =>  1:00
- Note taken on [2019-01-22 Tue 15:00] \\
Video editing
CLOCK: [2019-01-23 Wed 06:00]--[2019-01-23 Wed 07:00] =>  1:00
- Note taken on [2019-01-23 Wed 06:00] \\
Video editing
CLOCK: [2019-01-23 Wed 09:00]--[2019-01-23 Wed 10:00] =>  1:00
- Note taken on [2019-01-23 Wed 09:00] \\
Video edit
CLOCK: [2019-01-24 Thu 08:30]--[2019-01-24 Thu 15:30] =>  7:00
CLOCK: [2019-01-25 Fri 08:00]--[2019-01-25 Fri 09:00] =>  1:00
CLOCK: [2019-01-26 Sat 05:30]--[2019-01-26 Sat 07:30] =>  2:00
- Note taken on [2019-01-26 Sat 05:30] \\
Avtal
CLOCK: [2019-01-26 Sat 16:00]--[2019-01-26 Sat 17:30] =>  1:30
- Note taken on [2019-01-26 Sat 16:00] \\
Video editing
CLOCK: [2019-01-27 Sun 14:30]--[2019-01-27 Sun 15:30] =>  1:00
- Note taken on [2019-01-27 Sun 14:30] \\
Video edit
CLOCK: [2019-01-28 Mon 09:30]--[2019-01-28 Mon 10:30] =>  1:00
- Note taken on [2019-01-28 Mon 09:30] \\
Kundkontakt
CLOCK: [2019-01-28 Mon 21:00]--[2019-01-28 Mon 21:30] =>  0:30
CLOCK: [2019-02-01 Fri 20:00]--[2019-02-01 Fri 21:00] =>  1:00
CLOCK: [2019-02-12 Tue 07:30]--[2019-02-12 Tue 09:30] =>  2:00
- Note taken on [2019-02-12 Tue 07:30] \\
Post youtube videos
CLOCK: [2019-02-20 Wed 07:00]--[2019-02-20 Wed 07:30] =>  0:30
- Note taken on [2019-02-20 Wed 07:00] \\
Animal dynamics
CLOCK: [2019-03-05 Tue 05:00]--[2019-03-05 Tue 07:00] =>  2:00
- Note taken on [2019-03-05 Tue 05:00] \\
Look up possibility to use gumroad and render images
CLOCK: [2019-03-05 Tue 09:30]--[2019-03-05 Tue 11:30] =>  2:00
- Note taken on [2019-03-05 Tue 09:30] \\
Video titles and publish unpublished
CLOCK: [2019-03-05 Tue 14:00]--[2019-03-05 Tue 15:00] =>  1:00
- Note taken on [2019-03-05 Tue 14:00] \\
Name youtube videos
CLOCK: [2019-03-06 Wed 05:00]--[2019-03-06 Wed 07:00] =>  2:00
- Note taken on [2019-03-06 Wed 05:00] \\
Start writing product description
CLOCK: [2019-03-07 Thu 08:30]--[2019-03-07 Thu 12:30] =>  4:00
- Note taken on [2019-03-07 Thu 08:30] \\
Gumroad product
CLOCK: [2019-03-21 Thu 17:00]--[2019-03-21 Thu 20:00] =>  3:00
- Note taken on [2019-03-21 Thu 17:00] \\
Things 4 år
CLOCK: [2019-03-26 Tue 09:00]--[2019-03-26 Tue 11:30] =>  2:30
- Note taken on [2019-03-26 Tue 09:00] \\
Infrasonik
CLOCK: [2019-03-26 Tue 13:00]--[2019-03-26 Tue 19:00] =>  6:00
- Note taken on [2019-03-26 Tue 13:00] \\
Setup website using hugo and vps
CLOCK: [2019-03-26 Tue 19:00]--[2019-03-26 Tue 21:00] =>  2:00
- Note taken on [2019-03-26 Tue 19:00] \\
Offer infra
CLOCK: [2019-03-27 Wed 05:00]--[2019-03-27 Wed 06:00] =>  1:00
- Note taken on [2019-03-27 Wed 05:00] \\
Offert
CLOCK: [2019-03-27 Wed 10:00]--[2019-03-27 Wed 11:30] =>  1:30
- Note taken on [2019-03-27 Wed 10:00] \\
Gunnar möte
CLOCK: [2019-03-27 Wed 15:00]--[2019-03-27 Wed 16:00] =>  1:00
- Note taken on [2019-03-27 Wed 15:00] \\
Offert skickat
CLOCK: [2019-04-10 Wed 11:00]--[2019-04-10 Wed 13:00] =>  2:00
- Note taken on [2019-04-10 Wed 11:00] \\
Website and streaming accounts
CLOCK: [2019-04-17 Wed 09:00]--[2019-04-17 Wed 12:00] =>  3:00
- Note taken on [2019-04-17 Wed 09:00] \\
Relox
CLOCK: [2019-04-20 Sat 12:00]--[2019-04-20 Sat 15:00] =>  3:00
- Note taken on [2019-04-20 Sat 12:00] \\
Gunnar
CLOCK: [2019-04-24 Wed 14:00]--[2019-04-24 Wed 15:00] =>  1:00
CLOCK: [2019-04-24 Wed 15:00]--[2019-04-24 Wed 16:00] =>  1:00
:END:
** DONE Admin
:LOGBOOK:
CLOCK: [2019-03-31 Sun 07:30]--[2019-03-31 Sun 09:30] =>  2:00
- Note taken on [2019-03-31 Sun 07:30] \\
Bokföring
CLOCK: [2019-03-31 Sun 17:00]--[2019-03-31 Sun 18:30] =>  1:30
- Note taken on [2019-03-31 Sun 17:00] \\
Bokföra mar apr
CLOCK: [2019-04-01 Mon 08:30]--[2019-04-01 Mon 09:30] =>  1:00
- Note taken on [2019-04-01 Mon 08:30] \\
Bokföring
CLOCK: [2019-04-01 Mon 14:30]--[2019-04-01 Mon 17:00] =>  2:30
- Note taken on [2019-04-01 Mon 14:30] \\
Bokföring
CLOCK: [2019-04-01 Mon 19:30]--[2019-04-01 Mon 22:30] =>  3:00
- Note taken on [2019-04-01 Mon 19:30] \\
Momsdekl
CLOCK: [2019-04-06 Sat 16:00]--[2019-04-06 Sat 17:00] =>  1:00
CLOCK: [2019-04-24 Wed 09:00]--[2019-04-24 Wed 11:00] =>  2:00
CLOCK: [2019-04-26 Fri 06:00]--[2019-04-26 Fri 07:00] =>  1:00
- Note taken on [2019-04-26 Fri 06:00] \\
Mouser crp
CLOCK: [2019-04-26 Fri 16:00]--[2019-04-26 Fri 17:30] =>  1:30
- Note taken on [2019-04-26 Fri 16:00] \\
Fix stlink and serial
CLOCK: [2019-04-29 Mon 09:00]--[2019-04-29 Mon 11:00] =>  2:00
- Note taken on [2019-04-29 Mon 09:00] \\
Make plan for wiseled
CLOCK: [2019-04-29 Mon 14:00]--[2019-04-29 Mon 16:00] =>  2:00
- Note taken on [2019-04-29 Mon 14:00] \\
Plan in org mode
:END:
** DONE Software
*** Prepare theboss for standalone builds
:LOGBOOK:
CLOCK: [2019-03-14 Thu 11:00]--[2019-03-14 Thu 16:30] =>  5:30
- Note taken on [2019-03-14 Thu 11:00] \\
Prepare theboss for standalone builds
:END:
*** Console driver improvements
:LOGBOOK:
CLOCK: [2019-03-25 Mon 06:00]--[2019-03-25 Mon 07:00] =>  1:00
- Note taken on [2019-03-25 Mon 06:00] \\
Console driver
:END:
*** MCP2317 device support
:LOGBOOK:
CLOCK: [2019-03-25 Mon 12:30]--[2019-03-25 Mon 14:00] =>  1:30
- Note taken on [2019-03-25 Mon 12:30] \\
Mcp2317
:END:
*** Timer support and dts nodes
:LOGBOOK:
CLOCK: [2019-03-27 Wed 09:00]--[2019-03-27 Wed 10:00] =>  1:00
- Note taken on [2019-03-27 Wed 09:00] \\
Dts for timers
CLOCK: [2019-03-27 Wed 11:30]--[2019-03-27 Wed 15:00] =>  3:30
- Note taken on [2019-03-27 Wed 11:30] \\
Timer and drv drivers
CLOCK: [2019-03-27 Wed 16:00]--[2019-03-27 Wed 16:30] =>  0:30
- Note taken on [2019-03-27 Wed 16:00] \\
Timers
:END:
*** I2C support
:LOGBOOK:
CLOCK: [2019-03-27 Wed 19:30]--[2019-03-27 Wed 21:30] =>  2:00
- Note taken on [2019-03-27 Wed 19:30] \\
I2c
CLOCK: [2019-04-03 Wed 13:30]--[2019-04-03 Wed 16:00] =>  2:30
- Note taken on [2019-04-03 Wed 13:30] \\
Fix spi and i2c
:END:
*** Gate driver debugging and drivers
:LOGBOOK:
CLOCK: [2019-03-28 Thu 05:30]--[2019-03-28 Thu 07:00] =>  1:30
- Note taken on [2019-03-28 Thu 05:30] \\
Get gate drive working
:END:
*** Analog device support
:LOGBOOK:
CLOCK: [2019-03-28 Thu 09:00]--[2019-03-28 Thu 13:00] =>  4:00
- Note taken on [2019-03-28 Thu 09:00] \\
Analog i2c
CLOCK: [2019-04-02 Tue 05:00]--[2019-04-02 Tue 07:00] =>  2:00
- Note taken on [2019-04-02 Tue 05:00] \\
Other pots and switches
CLOCK: [2019-04-02 Tue 08:30]--[2019-04-02 Tue 09:30] =>  1:00
- Note taken on [2019-04-02 Tue 08:30] \\
Pots and switches
CLOCK: [2019-04-02 Tue 15:00]--[2019-04-02 Tue 18:30] =>  3:30
- Note taken on [2019-04-02 Tue 15:00] \\
Get limits working
CLOCK: [2019-04-11 Thu 09:00]--[2019-04-11 Thu 17:00] =>  8:00
- Note taken on [2019-04-11 Thu 09:00] \\
Adc debug
CLOCK: [2019-04-11 Thu 19:00]--[2019-04-11 Thu 21:00] =>  2:00
- Note taken on [2019-04-11 Thu 19:00] \\
Adcs fixed
CLOCK: [2019-04-12 Fri 04:30]--[2019-04-12 Fri 07:00] =>  2:30
- Note taken on [2019-04-12 Fri 04:30] \\
ADC current amps
CLOCK: [2019-04-18 Thu 11:00]--[2019-04-18 Thu 13:30] =>  2:30
- Note taken on [2019-04-18 Thu 11:00] \\
Vmot measure
:END:
*** Cylinder and joystick
:LOGBOOK:
CLOCK: [2019-03-28 Thu 13:30]--[2019-03-28 Thu 16:00] =>  2:30
- Note taken on [2019-03-28 Thu 13:30] \\
Test cylinder with joystick
CLOCK: [2019-03-29 Fri 04:30]--[2019-03-29 Fri 07:00] =>  2:30
- Note taken on [2019-03-29 Fri 04:30] \\
Two motos
CLOCK: [2019-03-29 Fri 08:30]--[2019-03-29 Fri 09:30] =>  1:00
- Note taken on [2019-03-29 Fri 08:30] \\
Demo fpr gunnar
CLOCK: [2019-03-29 Fri 19:00]--[2019-03-29 Fri 22:00] =>  3:00
- Note taken on [2019-03-29 Fri 19:00] \\
Encoder debugging
CLOCK: [2019-03-30 Sat 05:00]--[2019-03-30 Sat 08:00] =>  3:00
- Note taken on [2019-03-30 Sat 05:00] \\
Break res and positioning of both motors
:END:
*** Leds and buttons support
:LOGBOOK:
CLOCK: [2019-03-28 Thu 19:00]--[2019-03-28 Thu 21:00] =>  2:00
- Note taken on [2019-03-28 Thu 19:00] \\
Leds and buttons
:END:
*** Meetings and discussions
:LOGBOOK:
CLOCK: [2019-04-03 Wed 05:00]--[2019-04-03 Wed 12:30] =>  7:30
- Note taken on [2019-04-03 Wed 05:00] \\
Gunnar och implementation av kontroll
:END:
*** CAN bus support
:LOGBOOK:
CLOCK: [2019-04-04 Thu 10:30]--[2019-04-04 Thu 14:00] =>  3:30
- Note taken on [2019-04-04 Thu 10:30] \\
CAN
CLOCK: [2019-04-04 Thu 15:00]--[2019-04-04 Thu 17:30] =>  2:30
- Note taken on [2019-04-04 Thu 15:00] \\
Vardir refactor
CLOCK: [2019-04-05 Fri 05:00]--[2019-04-05 Fri 07:00] =>  2:00
- Note taken on [2019-04-05 Fri 05:00] \\
Canopen
CLOCK: [2019-04-05 Fri 08:30]--[2019-04-05 Fri 14:30] =>  6:00
- Note taken on [2019-04-05 Fri 08:30] \\
Canopen
CLOCK: [2019-04-05 Fri 15:30]--[2019-04-05 Fri 17:00] =>  1:30
- Note taken on [2019-04-05 Fri 15:30] \\
Canopen
CLOCK: [2019-04-06 Sat 04:30]--[2019-04-06 Sat 09:00] =>  4:30
- Note taken on [2019-04-06 Sat 04:30] \\
Fix canopen can1 and 2
CLOCK: [2019-04-07 Sun 10:00]--[2019-04-07 Sun 12:00] =>  2:00
- Note taken on [2019-04-07 Sun 10:00] \\
Fix can timing
CLOCK: [2019-04-08 Mon 06:00]--[2019-04-08 Mon 07:00] =>  1:00
- Note taken on [2019-04-08 Mon 06:00] \\
Canopen pdo
CLOCK: [2019-04-08 Mon 09:00]--[2019-04-08 Mon 13:00] =>  4:00
- Note taken on [2019-04-08 Mon 09:00] \\
Canopen
CLOCK: [2019-04-08 Mon 14:00]--[2019-04-08 Mon 16:00] =>  2:00
- Note taken on [2019-04-08 Mon 14:00] \\
Get motor running on remote
CLOCK: [2019-04-08 Mon 18:30]--[2019-04-08 Mon 20:30] =>  2:00
- Note taken on [2019-04-08 Mon 18:30] \\
Get remote control working properly
CLOCK: [2019-04-09 Tue 09:00]--[2019-04-09 Tue 14:30] =>  5:30
- Note taken on [2019-04-09 Tue 09:00] \\
Get working canopen control
CLOCK: [2019-04-09 Tue 15:30]--[2019-04-09 Tue 16:00] =>  0:30
CLOCK: [2019-04-09 Tue 19:00]--[2019-04-09 Tue 23:00] =>  4:00
- Note taken on [2019-04-09 Tue 19:00] \\
Getting closer
CLOCK: [2019-04-10 Wed 05:00]--[2019-04-10 Wed 07:00] =>  2:00
CLOCK: [2019-04-10 Wed 09:00]--[2019-04-10 Wed 11:00] =>  2:00
- Note taken on [2019-04-10 Wed 09:00] \\
Demo
:END:
*** Code review and refactor
:LOGBOOK:
CLOCK: [2019-04-12 Fri 09:30]--[2019-04-12 Fri 13:00] =>  3:30
- Note taken on [2019-04-12 Fri 09:30] \\
Code review
CLOCK: [2019-04-12 Fri 14:00]--[2019-04-12 Fri 17:00] =>  3:00
- Note taken on [2019-04-12 Fri 14:00] \\
Review
CLOCK: [2019-04-15 Mon 14:00]--[2019-04-15 Mon 16:00] =>  2:00
- Note taken on [2019-04-15 Mon 14:00] \\
Refactor
CLOCK: [2019-04-15 Mon 18:00]--[2019-04-15 Mon 23:00] =>  5:00
- Note taken on [2019-04-15 Mon 19:00] \\
Refactor
CLOCK: [2019-04-16 Tue 00:00]--[2019-04-16 Tue 02:00] =>  2:00
- Note taken on [2019-04-16 Tue 00:00] \\
Switch to single can
CLOCK: [2019-04-17 Wed 19:30]--[2019-04-17 Wed 23:00] =>  3:30
CLOCK: [2019-04-18 Thu 00:00]--[2019-04-18 Thu 02:00] =>  2:00
CLOCK: [2019-04-18 Thu 14:30]--[2019-04-18 Thu 16:30] =>  2:00
- Note taken on [2019-04-18 Thu 14:30] \\
Event subsystem
:END:
*** Controller implementation
:LOGBOOK:
CLOCK: [2019-04-19 Fri 07:00]--[2019-04-19 Fri 09:00] =>  2:00
- Note taken on [2019-04-19 Fri 07:00] \\
Control
CLOCK: [2019-04-19 Fri 15:30]--[2019-04-19 Fri 17:30] =>  2:00
CLOCK: [2019-04-19 Fri 21:00]--[2019-04-19 Fri 23:00] =>  2:00
- Note taken on [2019-04-19 Fri 22:00] \\
Tuning pid
CLOCK: [2019-04-20 Sat 05:00]--[2019-04-20 Sat 08:30] =>  3:30
- Note taken on [2019-04-20 Sat 05:00] \\
Controller design
CLOCK: [2019-04-20 Sat 10:00]--[2019-04-20 Sat 12:00] =>  2:00
- Note taken on [2019-04-20 Sat 10:00] \\
Controller
:END:
*** UI console
:LOGBOOK:
CLOCK: [2019-04-20 Sat 15:00]--[2019-04-20 Sat 17:30] =>  2:30
- Note taken on [2019-04-20 Sat 15:00] \\
Ui console
CLOCK: [2019-04-22 Mon 07:00]--[2019-04-22 Mon 08:00] =>  1:00
- Note taken on [2019-04-22 Mon 07:00] \\
UI
CLOCK: [2019-04-24 Wed 16:00]--[2019-04-24 Wed 17:00] =>  1:00
:END:
*** USB
:LOGBOOK:
CLOCK: [2019-04-25 Thu 09:00]--[2019-04-25 Thu 15:30] =>  6:30
- Note taken on [2019-04-25 Thu 09:00] \\
Usb vcp
CLOCK: [2019-04-25 Thu 19:00]--[2019-04-25 Thu 21:00] =>  2:00
- Note taken on [2019-04-25 Thu 19:00] \\
Vcp working
:END:
** NEXT Fix the time interval bug
SCHEDULED: <2019-05-01 Wed> DEADLINE: <2019-05-01 Wed>
:LOGBOOK:
CLOCK: [2019-05-06 Mon 08:30]--[2019-05-06 Mon 10:00] =>  1:30
:END:
** NEXT Get the invoice paid
** WAITING Add unit tests
** DONE Account project time from start to end of april
** Add support for saving config
*** PID values
*** Limits
** Implement current based control
*** DC motor
*** PMSM motor
** Finish joystick control
*** Add deadband
** DONE Port to the new boss
:LOGBOOK:
CLOCK: [2019-05-04 Sat 03:30]--[2019-05-04 Sat 04:00] =>  0:30
:END:
** CANOpen variables for Motor Mode :ARCHIVE:
- [X] Pitch motor position (mm)
- [X] Yaw motor position (rad)
- [X] Pitch current (A)
- [X] Yaw current (A)
- [X] Supply voltage (V)
** NEXT User manual
SCHEDULED: <2019-05-08 Wed>
:PROPERTIES:
:Effort:   6:00
:END:
:LOGBOOK:
CLOCK: [2019-05-02 Thu 14:00]--[2019-05-02 Thu 15:30] =>  1:30
:END:
*** NEXT Describe all contacts available on the board
**** Supported voltage levels
**** Picture of expected signal
**** Accessability inside the firmware
**** Serial interface test command(s)
*** Firmware flashing
**** ST-Link-V2 debugger
**** Serial port
**** USB
*** Usage
**** Powering the system
**** Setting home position
**** Manual control
***** Joystick motion
****** Reversing direction
****** Deadband
***** Intensity
***** Speed
**** Automatic control
***** Saving a preset
***** Invoking a presets
***** Aborting motion
**** Configuring the settings
***** Motion limits
** Package up the system for delivery
- [ ] 2 working motor control boards
- [ ] 2 working control panel boards
- [ ] 1 Printed user manual
- [ ] Connectors
